//TODO:===================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const number = 10;
// const b = 5;
// if (number === 10) {
//   console.log(true);
// } else {
//   console.log(false);
// }

//b === number ? console.log(true) : console.log(false);

//TODO:===================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// const min = 35;

// if (0 <= min && min <= 15) {
//   console.log("Перша чверть");
// }
// if (16 <= min && min <= 29) {
//   console.log("Друга чверть");
// }
// if (30 <= min && min <= 44) {
//   console.log("Третя чверть");
// }
// if (45 <= min && min <= 59) {
//   console.log("Четверта чверть");
// }
