//TODO:===================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const number = 10;
// const b = 5;
// if (number === 10) {
//   console.log(true);
// } else {
//   console.log(false);
// }

//b === number ? console.log(true) : console.log(false);

//TODO:===================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// const min = 35;

// if (0 <= min && min <= 15) {
//   console.log("Перша чверть");
// }
// if (16 <= min && min <= 29) {
//   console.log("Друга чверть");
// }
// if (30 <= min && min <= 44) {
//   console.log("Третя чверть");
// }
// if (45 <= min && min <= 59) {
//   console.log("Четверта чверть");
// }

//Example 3
//TODO:===================================
//Використовуючи конструкцію if...else,
//напишіть код, який запитуватиме:
//"Яка офіційна назва JavaScript?"
//Якщо користувач вводить "ECMAScript",
// показати через alert: "Вірно!"
//інакше відобразити: "Не знаєте? ECMAScript!"

// const question = prompt('"Яка офіційна назва JavaScript?"');

// if (question === "ECMAScript") {
//     alert("Вірно!");
// } else {
// alert("Не знаєте? ECMAScript!")
// }

//Example 4
//TODO:===================================
//Напишіть цикл, який виводить у консоль
// числа від max до min за спаданням
// Додайте усі парні числа від min до max

// const max = 50;
// const min = 23;
// let totalNumber = 0;

// for (let i = max; i >= min; i -= 1) {
//     if (i % 2 === 0) {
//         totalNumber += i
//     }
// }

// console.log(totalNumber);

//Example 5
// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

const pass = prompt("Введить логін");
// if (pass === "Адмін") {
//   const password = prompt("Введить пароль");
//   if (password) {
//     if (password === "Я головний") {
//       console.log("Здрастуйте!");
//     } else {
//       console.log("Невірний пароль!");
//     }
//   } else {
//     console.log("Скасовано");
//   }
// } else {
//   console.log("Я вас не знаю");
// }
